In [1]:
import pandas as pd

In [19]:
df = pd.read_csv('SPY.csv')

In [20]:
df.head()

,Price,Close,High,Low,Open,Volume
0,Ticker,SPY,SPY,SPY,SPY,SPY
1,Date,NaN,NaN,NaN,NaN,NaN
2,2018-01-02,237.9091339111328,237.9445485729644,236.69644512475205,237.08592536448378,86655700
3,2018-01-03,239.41397094726562,239.56446301538605,238.07734421407596,238.07734421407596,90070400
4,2018-01-04,240.42303466796875,240.90989847444283,239.47591532497438,240.06013568466005,80636400

In [21]:
df_clean = df.drop([0,1])

In [22]:
df_clean.head()

,Price,Close,High,Low,Open,Volume
2,2018-01-02,237.9091339111328,237.9445485729644,236.69644512475205,237.08592536448378,86655700
3,2018-01-03,239.41397094726562,239.56446301538605,238.07734421407596,238.07734421407596,90070400
4,2018-01-04,240.42303466796875,240.90989847444283,239.47591532497438,240.06013568466005,80636400
5,2018-01-05,242.02520751953125,242.14911830388075,240.72399570977953,241.21969287411642,83524000
6,2018-01-08,242.4678192138672,242.62714467178108,241.63575024902096,241.92784692186305,57319200

In [27]:
df_clean = df.iloc[2:]

In [28]:
df_clean.head()

,Price,Close,High,Low,Open,Volume
2,2018-01-02,237.9091339111328,237.9445485729644,236.69644512475205,237.08592536448378,86655700
3,2018-01-03,239.41397094726562,239.56446301538605,238.07734421407596,238.07734421407596,90070400
4,2018-01-04,240.42303466796875,240.90989847444283,239.47591532497438,240.06013568466005,80636400
5,2018-01-05,242.02520751953125,242.14911830388075,240.72399570977953,241.21969287411642,83524000
6,2018-01-08,242.4678192138672,242.62714467178108,241.63575024902096,241.92784692186305,57319200